Public Member Functions | List of all members
ACAPI::UniqueID Class Reference
API Infrastructure
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element. More...
#include <UniqueID.hpp>
 Inheritance diagram for ACAPI::UniqueID:
 Public Member Functions
UniqueID (const GS::Guid &, const API_Token &)
Constructs a unique identifier with the given GUID and token.
UniqueID (const API_Guid &guid, const API_Token &token)
Constructs a unique identifier with the given GUID and token.
const GS::Guid &  | GetGuid () const
Returns the unique identifier of the element.
const API_Token &  | GetToken () const
Returns the unique identifier of the AddOn which created this instance.
bool  | operator== (const UniqueID &) const
Comparison operator.
bool  | operator!= (const UniqueID &) const
Comparison operator.
bool  | operator< (const UniqueID &) const
Comparison operator.
Detailed Description
A unique identifier for API objects. It contains the GUID of the element and the Token of the AddOn which instantiated the element.
Constructor & Destructor Documentation
◆ UniqueID()
 ACAPI::UniqueID::UniqueID  |  ( |  const API_Guid & |  guid,
|  const API_Token & |  token )
inline
Constructs a unique identifier with the given GUID and token.
Parameters
guid | The GUID of the identified object.
token | The token of the AddOn which created the element.
Member Function Documentation
◆ GetGuid()
 const GS::Guid & ACAPI::UniqueID::GetGuid  |  ( |   | ) |   const
Returns the unique identifier of the element.
Returns
The unique identifier of the element.
◆ GetToken()
 const API_Token & ACAPI::UniqueID::GetToken  |  ( |   | ) |   const
Returns the unique identifier of the AddOn which created this instance.
Returns
The unique identifier of the AddOn which created this instance.
◆ operator!=()
 bool ACAPI::UniqueID::operator!=  |  ( |  const UniqueID & |   | ) |   const
Comparison operator.
Returns
True if given object is not equal to this object.
◆ operator<()
 bool ACAPI::UniqueID::operator<  |  ( |  const UniqueID & |   | ) |   const
Comparison operator.
Returns
True if given object is bigger than this object.
◆ operator==()
 bool ACAPI::UniqueID::operator==  |  ( |  const UniqueID & |   | ) |   const
Comparison operator.
Returns
True if given object is equal to this object.